Revit 2027 API
BuiltInFailures.MassFailures.SplitOverlappingFacesFailed Property
 Failed to resolve all overlaps between faces of the same Mass Energy Analytical Model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SplitOverlappingFacesFailed { get; }
Public Shared ReadOnly Property SplitOverlappingFacesFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SplitOverlappingFacesFailed {
	FailureDefinitionId^ get ();
}
static member SplitOverlappingFacesFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MassFailures Class
Autodesk.Revit.DB Namespace